[{
	"id": "if968",
	"nome": "Programação 1",
	"class": "comp",
	"tipo": "Obrigatória",
	"periodo": 1,
	"ch": 60,
	"creditos": 3,
	"ementa": "Conceitos básicos de algoritmos; Conceitos básicos de linguagens de programação; Conceitos básicos de programação orientada a objetos e qualidade de software; Ambiente de programação; Estruturas de controle e estruturas de dados compostas; Arquivos; Conceitos básicos de estruturas de dados; Projeto de implementação",
	"pre": [],
	"co": [],
	"site": "https://sites.google.com/a/cin.ufpe.br/if968si/",
	"box": 1
},{
	"id": "if966",
	"nome": "Introdução aos Sistemas de Informação",
	"class": "si",
	"tipo": "Obrigatória",
	"periodo": 1,
	"ch": 60,
	"creditos": 4,
	"ementa": "Conceitos básicos. Evolução histórica. Introdução aos Sistemas de Informação. Introdução as Tecnologias de Informação e Comunicação. Empresas digitais. Questões éticas e sociais. O mercado.",
	"pre": [],
	"co": [],
	"site": "",
	"box": 1
},{
	"id": "if967",
	"nome": "Matemática Discreta para Computação",
	"class": "comp",
	"tipo": "Obrigatória",
	"periodo": 1,
	"ch": 60,
	"creditos": 4,
	"ementa": "Introdução; Indução e Recursão; Teoria dos Conjuntos; Álgebra Discreta; Teoria dos Números; Combinatória; Funções Geradoras.",
	"pre": [],
	"co": [],
	"site": "http://cin.ufpe.br/~jmi/md/",
	"box": 1
},{
	"nome": "Cálculo Diferencial e Integral 1",
	"tipo": "Obrigatória",
	"ementa": "Limites e Continuidade de Funções. Derivadas. Aplicações da Derivada. Teorema De Rolle, Teorema do Valor Médio e Teorema do Valor Médio Generalizado. Integrais Definidas. Integrais Indefinidas. Técnicas de Integração.",
	"ch": 60,
	"periodo": 1,
	"pre": [],
	"co": [],
	"creditos": 4,
	"site": "https://sites.google.com/a/cin.ufpe.br/cdi/",
	"class": "mat",
	"id": "ma026",
	"box": 1
},{
	"nome": "Administração Contemporânea",
	"tipo": "Obrigatória",
	"ementa": "Fundamentos teóricos. Design organizacional – estruturas organizacionais e processos organizacionais. Racionalidade gerencial. Novas tendências em administração. Redes organizacionais. Inovação organizacional.",
	"ch": 60,
	"periodo": 1,
	"pre": [],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "adm",
	"id": "ad431",
	"box": 1
},{
	"nome": "Algoritmos e Estruturas de Dados",
	"tipo": "Obrigatória",
	"ementa": "Conceitos Básicos de Algoritmos; Algoritmos e Estruturas de Dados Dinâmicas Básicas; Técnicas de Construção de Algoritmos; Conceitos de Complexidade de Algoritmo.",
	"ch": 60,
	"periodo": 2,
	"pre": ["if968"],
	"co": [],
	"creditos": 4,
	"site": "http://cin.ufpe.br/~if969/",
	"class": "comp",
	"id": "if969",
	"box": 2
},{
	"nome": "Inglês para Computação",
	"tipo": "Obrigatória",
	"ementa": "Vocabulário e Expressões Idiomáticas Inglesas em Ciências da Computação e Tecnologia da Informação; Interpretação de Textos Técnico-Científicos em Inglês; Compreensão de Apresentações Orais Técnico-Científicos em Inglês; Estilística da Redação de Documentos Técnico-Científicos em Inglês; Estilística de Seminários Orais Técnico-Científicos em Inglês.",
	"ch": 60,
	"periodo": 2,
	"pre": [],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "outros",
	"id": "le732",
	"box": 2
},{
	"nome": "Lógica para Computação",
	"tipo": "Obrigatória",
	"ementa": "Introdução a Lógica; Lógica Proposicional; Lógica dos Predicados; Aplicações práticas para Computação (programação lógica); Tópicos Avançados: Lógicas Não Clássicas.",
	"ch": 60,
	"periodo": 0,
	"pre": ["if967"],
	"co": [],
	"creditos": 4,
	"site": "http://cin.ufpe.br/~if972",
	"class": "comp",
	"id": "if972",
	"box": 2
},{
	"nome": "Estatística e Probabilidade para Computação",
	"tipo": "Obrigatória",
	"ementa": "Estatística Descritiva; Probabilidade; Estatística Inferencial. Eventos. Experimentos aleatórios. Teoria da amostragem.",
	"ch": 60,
	"periodo": 2,
	"pre": ["ma026"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "mat",
	"id": "if971",
	"box": 2
},{
	"nome": "Análise das Organizações",
	"tipo": "Obrigatória",
	"ementa": "Entendimento da Composição Organizacional; A Conceituação da Organização Como Entidade Social; Configurações Organizacionais.",
	"ch": 60,
	"periodo": 2,
	"pre": ["ad431"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "adm",
	"id": "ad291",
	"box": 2
},{
	"nome": "Organização de Computadores e Sistemas Operacionais",
	"tipo": "Obrigatória",
	"ementa": "Estudo de conceitos de arquitetura, da organização de computadores e dos sistemas de gerenciamento de recursos de um sistema de computação.",
	"ch": 60,
	"periodo": 3,
	"pre": ["if969"],
	"co": [],
	"creditos": 3,
	"site": "",
	"class": "comp",
	"id": "if974",
	"box": 3
},{
	"nome": "Fundamentos de Sistemas de Informação",
	"tipo": "Obrigatória",
	"ementa": "O papel estratégico dos sistemas de informação nas organizações. Valoração e gestão de mudanças. Desenvolvimento. Aquisição. Gestão. Sistemas de informação nas organizações.",
	"ch": 60,
	"periodo": 3,
	"pre": ["if966"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if973",
	"box": 3
},{
	"nome": "Redes de Computadores",
	"tipo": "Obrigatória",
	"ementa": "Redes de computadores. Topologias. Protocolos. Modelo de Referência OSI. TCP/IP. Outras implementações.",
	"ch": 60,
	"periodo": 3,
	"pre": ["if968"],
	"co": [],
	"creditos": 3,
	"site": "",
	"class": "comp",
	"id": "if975",
	"box": 3
},{
	"nome": "Contabilidade de Custos e Gerencial",
	"tipo": "Obrigatória",
	"ementa": "Fundamentos de Contabilidade de Custos e Gerencial. Métodos de Custeio para Avaliação de Estoques e Mensuração do Lucro e para o Processo de Tomada de Decisão. Informações para tomada de decisão. Mensuração de custos relevantes para a tomada de decisão. Custos para Controle. Contabilidade por Responsabilidade.",
	"ch": 60,
	"periodo": 3,
	"pre": ["if971"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "adm",
	"id": "ct503",
	"box": 3
},{
	"nome": "Comportamento Organizacional",
	"tipo": "Obrigatória",
	"ementa": "O papel da disciplina comportamento organizacional na administração moderna. Administração das organizações e eficácia organizacional. Características individuais e comportamento. Motivação. Comportamento e desempenho. Os grupos nas organizações. Liderança. Abordagens comportamentais de traço e de personalidade. Abordagem contingencial. Abordagem caminho-metas, e novas tendências da prática e pesquisa em liderança. Tópicos especiais em comportamento organizacional.",
	"ch": 60,
	"periodo": 3,
	"pre": ["ad291"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "adm",
	"id": "ad193",
	"box": 3
},{
	"nome": "Engenharia de Software",
	"tipo": "Obrigatória",
	"ementa": "Definição e objetivos da Engenharia de Software; Atividades da Engenharia de Software; Recursos da Engenharia de Software; Planejamento do projeto e levantamento de estimativas; Gerenciamento do projeto; Especificação de requisitos ; Análise e projeto; Implementação; Depuração e testes; Controle dequalidade e inspeção",
	"ch": 60,
	"periodo": 4,
	"pre": ["if968","if966"],
	"co": [],
	"creditos": 4,
	"site": "http://cin.ufpe.br/~if977",
	"class": "comp",
	"id": "if977",
	"box": 4
},{
	"nome": "Banco de Dados",
	"tipo": "Obrigatória",
	"ementa": "Conceitos Básicos sobre SGBD. Projeto Conceitual de Banco de Dados. Modelo Relacional. Projeto Lógico de Banco de Dados. Fundamentos de SQL e PL Conectividade com Banco de dados. Noções de XML e de Banco de Dados semi-estruturados. Projeto Prático.",
	"ch": 60,
	"periodo": 4,
	"pre": ["if966","if969"],
	"co": [],
	"creditos": 3,
	"site": "http://cin.ufpe.br/~if976/",
	"class": "comp",
	"id": "if976",
	"box": 4
},{
	"nome": "Gestão de Processos de Negócio",
	"tipo": "Obrigatória",
	"ementa": "Contextualização de Processos nas Organizações. - Noções Básicas de Processos e Modelagem Organizacional. Evolução da Gestão Organizacional. Melhoria de Processos e Reengenharia Organizacional. Ciclo de Vida da Gestão de Processos de Negócio. Notações e Ferramentas para Modelagem de Processos de Negócio.",
	"ch": 60,
	"periodo": 4,
	"pre": ["ad193", "if973"],
	"co": [],
	"creditos": 4,
	"site": "https://sites.google.com/site/gpnif978/",
	"class": "adm",
	"id": "if978",
	"box": 4
},{
	"nome": "Planejamento e Gerenciamento de Projetos",
	"tipo": "Obrigatória",
	"ementa": "Definição; Por que Gerência de Projetos? Ciclo de Vida de Projetos; Peculiaridades do Projeto de Software; Objetivos Gerais do Gerenciamento de Projetos; Equipe de Projeto; O Papel do Gerente; Estrutura Organizacional Voltada a Projetos. Planejamento Estratégico: Seleção de Projetos; Plano de Negócios. Planejamento Técnico: Ciclo de vida e processos de desenvolvimento de software (revisão); Tipos e métodos de planejamento; Análise de riscos; Estimativas: Custo; Tempo; Recursos; Tamanho e Complexidade.",
	"ch": 60,
	"periodo": 4,
	"pre": ["ad291"],
	"co": [],
	"creditos": 4,
	"site": "https://sites.google.com/a/cin.ufpe.br/if979/",
	"class": "si",
	"id": "if979",
	"box": 4
},{
	"nome": "Sistema de Gestão Empresarial",
	"tipo": "Obrigatória",
	"ementa": "Contexto histórico e conceitos básicos. Áreas funcionais e processos organizacionais. Planejamento, seleção, customização e manutenção de módulos/subsistemas. Melhoramento de processos organizacionais. Estudo de casos. Ferramentas de gestão empresarial.",
	"ch": 60,
	"periodo": 4,
	"pre": ["if973"],
	"co": ["if978"],
	"creditos": 3,
	"site": "https://sites.google.com/a/cin.ufpe.br/if980",
	"class": "si",
	"id": "if980",
	"box": 4
},{
	"nome": "Comunicação Técnica e Científica",
	"tipo": "Obrigatória",
	"ementa": "Comunicação: conceitos, funções, tipos e aplicações. Comunicações administrativas. Reuniões e eventos. Comunicação em equipes. Soluções de problemas de comunicação empresarial/institucional. Redação empresarial/institucional: memorando “Curriculum Vitae”; memento; relatório. Emprego da norma culta em trabalhos técnicos.",
	"ch": 60,
	"periodo": 5,
	"pre": [],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "outros",
	"id": "co691",
	"box": 5
},{
	"nome": "Gestão do Conhecimento e Informação",
	"tipo": "Obrigatória",
	"ementa": "A Sociedade da Informação e do Conhecimento; Conceitos Básicos de Teoria da Informação; Conceitos Básicos de Segurança da Informação; A Organização do Conhecimento; Trabalhador do Conhecimento; A Gestão do Conhecimento nas Organizações.",
	"ch": 60,
	"periodo": 5,
	"pre": ["if976","if980"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if982",
	"box": 5
},{
	"nome": "Sistemas de Apoio à Decisão",
	"tipo": "Obrigatória",
	"ementa": "Teoria da decisão. Fundamentos de decisão Multicritério. Fundamentos de teoria dos Jogos. Fundamentos de teoria da utilidade. Processo decisório. Sistemas de apoio à Decisão. Estudos de caso.",
	"ch": 60,
	"periodo": 5,
	"pre": ["if971", "if973", "if976"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if983",
	"box": 5
},{
	"nome": "Projeto de Sistema de Informação",
	"tipo": "Obrigatória",
	"ementa": "Desenvolvimento de um projeto de sistema de informação usando conceito aprendidos anteriormente. Projetos multidisciplinares devem ser estimulados bem como o trabalho em equipe, procurando construir um ambiente de desenvolvimento que seja o mais próximo do ambiente real que o futuro profissional encontrará. Deve-se estimular a formação de equipes com no mínimo oito alunos.",
	"ch": 60,
	"periodo": 6,
	"pre": ["if976", "if977", "if979"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if985",
	"box": 6
},{
	"nome": "Viabilidade Econômico-Financeira de Projetos de SI",
	"tipo": "Obrigatória",
	"ementa": "Tem como objetivo montar projetos de investimento em SI e avaliar sua viabilidade econômico-financeira, com cálculo de retorno do investimento e outros indicadores relevantes para tomada de decisão de investimento.",
	"ch": 60,
	"periodo": 6,
	"pre": [],
	"co": ["if985"],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if986",
	"box": 6
},{
	"nome": "Estágio Supervisionado",
	"tipo": "Obrigatória",
	"ementa": "Desenvolvimento de estudo, aplicação ou atividade em uma das áreas de Sistemas de Informação.",
	"ch": 60,
	"periodo": 6,
	"pre": [],
	"co": [],
	"creditos": 10,
	"site": "",
	"class": "outros",
	"id": "if984",
	"box": 6
},{
	"nome": "Auditoria e Segurança de Sistemas de Informação",
	"tipo": "Obrigatória",
	"ementa": "Fundamentos de segurança para sistemas de informação. Proteção da informação. Gestão de vulnerabilidade em sistemas de informação. Noções de auditoria de sistemas de informação.",
	"ch": 60,
	"periodo": 7,
	"pre": ["if973", "if974", "if975"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if987",
	"box": 7
},{
	"nome": "Estratégia e Planejamento",
	"tipo": "Obrigatória",
	"ementa": "Modelos conceituais de estratégia empresarial. Análise do ambiente externo. Estrutura industrial e fontes de dados para análise industrial. Análise de competidores. Sistema de inteligência sobre concorrentes. Análise de porfólio. Avaliação dos recursos competitivos. Definição de objetivos e metas de ação empresarial. Estratégias corporativas, empresariais e funcionais. Sua implementação e avaliação. Métodos e técnicas para planejamento estratégico.",
	"ch": 60,
	"periodo": 7,
	"pre": ["ad193"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "adm",
	"id": "ad432",
	"box": 7
},{
	"nome": "Empreendimentos em Informática",
	"tipo": "Obrigatória",
	"ementa": "Perfil e características do empreendedor. O plano de negócios. Criatividade. Idéias de negócios. Estudo de viabilidade de um negócio. Negociação. Conceitos básicos de legislação empresarial. Conceitos básicos de legislação de software. Desenvolvimento de um produto/serviço. Análise de mercado. Marketing. Análise financeira. Vendas e distribuição. Riscos e oportunidades. A visão e experiências de empreendedores reais.",
	"ch": 60,
	"periodo": 7,
	"pre": ["if985","ad432"],
	"co": [],
	"creditos": 4,
	"site": "",
	"class": "si",
	"id": "if988",
	"box": 8
},{
	"nome": "Administração de Banco de Dados",
	"tipo": "Eletiva",
	"ementa": "Administração de dados fundamentos sobre armazenamento de dados, indexação e  processamento/otimização de consulta noções de processamento de transações, concorrência e  recuperação conceitos práticos sobre administração de um sgbd",
	"ch": "60",
	"periodo": "0",
	"pre": ["if976"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "comp",
	"id": "if991",
	"box": "9"
},
{
	"nome": "Economia das Empresas",
	"tipo": "Eletiva",
	"ementa": "Introdução à microeconomia: produto, oferta, preço, mercadorias, produção e custos introdução à  macroeconomia: produtos, medição, contas nacionais, moedas, inflação, distribuição de renda e teoria do  desenvolvimento econômico",
	"ch": "60",
	"periodo": "0",
	"pre": ["ct503"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "adm",
	"id": "ec453",
	"box": "9"
},
{
	"nome": "Gestão da Produção",
	"tipo": "Eletiva",
	"ementa": "Introdução à gestão da produção conceitos fundamentais da gestão da produção estratégia  operacional e competitividade concepção para a produção planejamento de operações melhoria de  produtos e serviços",
	"ch": "60",
	"periodo": "0",
	"pre": ["ct503", "if978"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "adm",
	"id": "ep100",
	"box": "10"
},
{
	"nome": "Programação 2",
	"tipo": "Eletiva",
	"ementa": "Conceitos avançados da tecnologia de software orientado a objetos incluindo linguagens, análise,  arquiteturas, desenvolvimento, refinamento, padrões, aplicações e sistemas orientados a objetos",
	"ch": "60",
	"periodo": "0",
	"pre": ["if976", "if977"],
	"co": [],
	"creditos": 3,
	"site": "",
	"class": "comp",
	"id": "if992",
	"box": "13"
},
{
	"nome": "Gestão de Pessoas e Equipes",
	"tipo": "Eletiva",
	"ementa": "Fundamentos do desenvolvimento de equipes fatores humanos motivação de equipes noções de  liderança dinâmica de equipes",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad193"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "adm",
	"id": "ad453",
	"box": "10"
},
{
	"nome": "Gestão de Processos de TI",
	"tipo": "Eletiva",
	"ementa": "A função si/ti alinhamento estratégico da ti o impacto dos si/ti na estrutura e nos processos  organizacionais valoração (economia) dos si planejamento dos si/ti gerenciando a função si/ti  financiando e avaliando o desempenho dos investimentos e da operação de si/ti aquisição de recursos e  capacidades de ti: aquisição de infraestrutura gerenciamento de risco de ti/si governança de ti cobit  itil estudo de casos de implementação do cobit e itil apoiando a gestão da tecnologia da informação com  cobit e itil",
	"ch": "60",
	"periodo": "0",
	"pre": ["if978", "if980"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if999",
	"box": "11"
},
{
	"nome": "Interação Humano-Computador",
	"tipo": "Eletiva",
	"ementa": "Fundamentos da interação humano-computador noções do design de interação design centrado no  usuário fatores humanos princípios de usabilidade",
	"ch": "60",
	"periodo": "0",
	"pre": ["if977"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "comp",
	"id": "if1000",
	"box": "11"
},
{
	"nome": "Introdução a Libras",
	"tipo": "Eletiva",
	"ementa": "Reflexão sobre os aspectos históricos da inclusão das pessoas surdas na sociedade em geral e na  escola a libras como língua de comunicação social em contexto de comunicação entre pessoas surdas e  como segunda língua estrutura linguística e gramatical de libras especificidades da escrita do aluno  surdo na produção de texto em língua portuguesa o intérprete e a interpretação como fator de  inclusão e acesso educacional para os alunos surdos ou com baixa audição",
	"ch": "60",
	"periodo": "0",
	"pre": [],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "outros",
	"id": "le716",
	"box": "11"
},
{
	"nome": "Processos de Software",
	"tipo": "Eletiva",
	"ementa": "Fundamentos do ciclo de vida de processos de software noções de ambiente de engenharia de software  orientado a processos modelos de processos de software qualidade de processos de software",
	"ch": "60",
	"periodo": "0",
	"pre": ["if977"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "comp",
	"id": "if993",
	"box": "13"
},
{
	"nome": "Programação 3",
	"tipo": "Eletiva",
	"ementa": "Programação para dispositivos móveis programação para a web projeto prático",
	"ch": "60",
	"periodo": "0",
	"pre": ["if992"],
	"co": [],
	"creditos": "3",
	"site": "",
	"class": "comp",
	"id": "if1001",
	"box": "13"
},
{
	"nome": "Qualidade de Software e da Informação",
	"tipo": "Eletiva",
	"ementa": "Qualidade do produto e do processo de software e de informação técnicas, modelos e padrões para a  garantia e controle da qualidade de software e informação métricas para a avaliação da qualidade do  software e informação",
	"ch": "60",
	"periodo": "0",
	"pre": ["if977","if982"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if994",
	"box": "12"
},

{
	"nome": "Seminário em SI 1",
	"tipo": "Eletiva",
	"ementa": "Participação e apresentação em seminários sobre temas específicos da área de engenharia de software e linguagens. Esta disciplina visa disseminar a participação de alunos de graduação em seminários de pesquisa de modo a estabelecer um contato entre alunos de graduação e de pós-graduação.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if995",
	"box": "14"
},
{
	"nome": "Seminário em SI 2",
	"tipo": "Eletiva",
	"ementa": "Participação e apresentação em seminários sobre temas específicos da área de engenharia de software e linguagens. Esta disciplina visa disseminar a participação de alunos de graduação em seminários de pesquisa de modo a estabelecer um contato entre alunos de graduação e de pós-graduação.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if996",
	"box": "14"
},
{
	"nome": "Seminário em SI 3",
	"tipo": "Eletiva",
	"ementa": "Participação e apresentação em seminários sobre temas específicos da área de engenharia de software e linguagens. Esta disciplina visa disseminar a participação de alunos de graduação em seminários de pesquisa de modo a estabelecer um contato entre alunos de graduação e de pós-graduação.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1004",
	"box": "14"
},
{
	"nome": "Seminário em SI 4",
	"tipo": "Eletiva",
	"ementa": "Participação e apresentação em seminários sobre temas específicos da área de engenharia de software e linguagens. Esta disciplina visa disseminar a participação de alunos de graduação em seminários de pesquisa de modo a estabelecer um contato entre alunos de graduação e de pós-graduação.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1005",
	"box": "14"
},
{
	"nome": "Seminário em SI 5",
	"tipo": "Eletiva",
	"ementa": "Participação e apresentação em seminários sobre temas específicos da área de engenharia de software e linguagens. Esta disciplina visa disseminar a participação de alunos de graduação em seminários de pesquisa de modo a estabelecer um contato entre alunos de graduação e de pós-graduação.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1012",
	"box": "14"
},
{
	"nome": "Seminário em SI 6",
	"tipo": "Eletiva",
	"ementa": "Participação e apresentação em seminários sobre temas específicos da área de engenharia de software e linguagens. Esta disciplina visa disseminar a participação de alunos de graduação em seminários de pesquisa de modo a estabelecer um contato entre alunos de graduação e de pós-graduação.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1013",
	"box": "15"
},
{
	"nome": "Tópicos Avançados em SI 1",
	"tipo": "Eletiva",
	"ementa": "Estudo de tópicos em si não abordados nas demais disciplinas e relevantes para complementar a formação geral do aluno.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if997",
	"box": "15"
},
{
	"nome": "Tópicos Avançados em SI 2",
	"tipo": "Eletiva",
	"ementa": "Estudo de tópicos em si não abordados nas demais disciplinas e relevantes para complementar a formação geral do aluno.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if998",
	"box": "15"
},
{
	"nome": "Tópicos Avançados em SI 3",
	"tipo": "Eletiva",
	"ementa": "Estudo de tópicos em si não abordados nas demais disciplinas e relevantes para complementar a formação geral do aluno.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1006",
	"box": "15"
},
{
	"nome": "Tópicos Avançados em SI 4",
	"tipo": "Eletiva",
	"ementa": "Estudo de tópicos em si não abordados nas demais disciplinas e relevantes para complementar a formação geral do aluno.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1007",
	"box": "15"
},
{
	"nome": "Tópicos Avançados em SI 5",
	"tipo": "Eletiva",
	"ementa": "Estudo de tópicos em si não abordados nas demais disciplinas e relevantes para complementar a formação geral do aluno.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1014",
	"box": "16"
},
{
	"nome": "Tópicos Avançados em SI 6",
	"tipo": "Eletiva",
	"ementa": "Estudo de tópicos em si não abordados nas demais disciplinas e relevantes para complementar a formação geral do aluno.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad291", "ad431", "if966", "if967", "if968", "if969", "if971", "if972", "if973", "le732", "ma026"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1015",
	"box": "16"
},
{
	"nome": "Tendências e Desafios em Sistemas de Informação",
	"tipo": "Eletiva",
	"ementa": "Grandes idéias e metáforas em computação, tendências tecnológicas e das organizações, novos paradigmas de pensar, fazer e aplicar computação nas organizações.",
	"ch": "60",
	"periodo": "8",
	"pre": ["if985"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if989",
	"box": "8"
},
{
	"nome": "Trabalho de Conclusão de Curso em Sistemas de Informação",
	"tipo": "Eletiva",
	"ementa": "Desenvolvimento de estudo ou aplicação em uma das áreas de sistemas de informação",
	"ch": "150",
	"periodo": "8",
	"pre": ["co691"],
	"co": [],
	"creditos": "7",
	"site": "",
	"class": "si",
	"id": "if990",
	"box": "8"
},
{
	"nome": "Administração de Sistemas",
	"tipo": "Eletiva",
	"ementa": "Principais conceitos sobre gerenciamento e configuração de serviços essenciais do sistema; automatizando tarefas; estratégias e tecnologias para realização de backup e restauração; atualização e manutenção de software; análise de carga do sistema; mecanismos e procedimentos de segurança; acordo de nível de serviços; continuidade; centro de dados; ferramentas.",
	"ch": "60",
	"periodo": "0",
	"pre": [],
	"co": [],
	"creditos": "3",
	"site": "",
	"class": "si",
	"id": "if1011",
	"box": "9"
},
{
	"nome": "Direito e Ética em Informática",
	"tipo": "Eletiva",
	"ementa": "Fundamentos de direito para informática; legislação e privacidade de sistemas de informação; ética e atuação do profissional de informática",
	"ch": "60",
	"periodo": "0",
	"pre": [],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "outros",
	"id": "pg515",
	"box": "9"
},
{
	"nome": "Inteligência Artificial",
	"tipo": "Eletiva",
	"ementa": "Conceitos básicos; raciocínio e representação do conhecimento; aprendizagem de máquina; sistemas especialistas e gerenciamento de conhecimento em organizações; descoberta automática de conhecimento; técnicas de mineração de dados.",
	"ch": "60",
	"periodo": "0",
	"pre": ["if971", "if972", "if992"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "comp",
	"id": "if1017",
	"box": "11"
},
{
	"nome": "Logística",
	"tipo": "Eletiva",
	"ementa": "Logística e cadeia de suprimentos; serviços ao cliente; sistemas de informação e tecnologias para logística; fornecedores; inventário; gerenciamento de matérias; transporte; armazenamento; manipulação e empacotamento de materiais; organização efetiva para logística; desempenho logístico financeiro; estratégia logística.",
	"ch": "60",
	"periodo": "0",
	"pre": ["if978", "if980"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "adm",
	"id": "ep101",
	"box": "12"
},
{
	"nome": "Sistemas Multimídia",
	"tipo": "Eletiva",
	"ementa": "Conceitos básicos fundamentos de multimídia, realidade virtual e realidade aumentada som no  computador animação e vídeo no computador elementos de realidade virtual integração de mídias  codificação de vídeo e som",
	"ch": "60",
	"periodo": "0",
	"pre": ["if1000", "if1001"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "comp",
	"id": "if1018",
	"box": "13"
},
{
	"nome": "Estágio Não-Obrigatório",
	"tipo": "Eletiva",
	"ementa": "Desenvolvimento de estudo, aplicação ou atividade em uma das áreas de sistemas de informação.",
	"ch": "150",
	"periodo": "0",
	"pre": ["if984"],
	"co": [],
	"creditos": "5",
	"site": "",
	"class": "outros",
	"id": "if1010",
	"box": "10"
},
{
	"nome": "Gestão de Portifólio de Projetos",
	"tipo": "Eletiva",
	"ementa": "Objetivos de aprendizagem: conhecer o contexto de aplicação e os benefícios da gestão de portfólio de projetos; conhecer os principais processos para gestão de portfólio; conhecer os aspectos da  implementação da gestão de portfólio em uma organização; utilizar as principais técnicas e ferramentas  para a identificação, categorização, avaliação, priorização, balanceamento e autorização de projetos; identificar métricas e processos de monitoramento de portfólio que podem ser implantados em uma organização; introdução; processos para gestão de portfólio de projetos; ferramentas para gestão de portfólio de projetos; implementando a gestão de portfólio de projetos; estudo de casos; tópicos avançados.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad432", "if979"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1019",
	"box": "10"
},
{
	"nome": "Relações Raciais",
	"tipo": "Eletiva",
	"ementa": "Analisar as condições sócio-históricas bem como as formações discursivas que têm posicionado a população negra em condições de subalternidade em relação à branca no contexto internacional e  brasileiro",
	"ch": "60",
	"periodo": "0",
	"pre": [],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "outros",
	"id": "in816",
	"box": "12"
},
{
	"nome": "Avaliação e Desempenho de Sistemas",
	"tipo": "Eletiva",
	"ementa": "Conceitos básicos de métodos quantitativos e técnicas de otimização de recursos métodos analíticos: cadeias de Markov, redes de filas de espera e outros métodos estocásticos; simulação discreta de sistemas",
	"ch": "60",
	"periodo": "0",
	"pre": ["if971", "if976", "if980"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1002",
	"box": "9"
},
{
	"nome": "Engenharia de Requisitos",
	"tipo": "Eletiva",
	"ementa": "Fundamentos do processo de engenharia de requisitos; modelos de ciclo de vida; processo de engenharia de requisitos; atividades do processo de engenharia de requisitos.",
	"ch": "60",
	"periodo": "0",
	"pre": ["if976", "if977", "if980"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1008",
	"box": "10"
},
{
	"nome": "Inovação em Sistemas de Informação",
	"tipo": "Eletiva",
	"ementa": "Ciência, tecnologia e inovação; Inovação em um mundo globalizado valoração das tecnologias da informação e comunicação; Novas tecnologias e tendências tecnológicas; Estratégias de inovação; Organizações inovadoras; O processo de inovação tecnológica; Políticas e agências de financiamento; Marcas e patentes; Estudo de casos.",
	"ch": "60",
	"periodo": "0",
	"pre": ["if979", "if980"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1003",
	"box": "11"
},
{
	"nome": "Marketing Empresarial",
	"tipo": "Eletiva",
	"ementa": "Fundamentos de marketing; Planejamento estratégico em marketing; Comportamento do consumidor; Gerenciamento da comunicação integrada de marketing; Marketing de serviços.",
	"ch": "60",
	"periodo": "0",
	"pre": ["ad193"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "adm",
	"id": "ad433",
	"box": "12"
},
{
	"nome": "Pensamento Sistêmico",
	"tipo": "Eletiva",
	"ementa": "Sistemas história do pensamento sistêmico princípios do pensamento sistêmico teoria geral de sistemas; Dinâmica de sistemas estruturas e linguagens aplicações do pensamento sistêmico; Sistemas complexos; Aprendizagem organizacional cibernética.",
	"ch": "60",
	"periodo": "0",
	"pre": ["if978"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "adm",
	"id": "ad434",
	"box": "12"
},
{
	"nome": "Teste de Validação de Software",
	"tipo": "Eletiva",
	"ementa": "Motivação técnicas de tese e validação de sistemas ferramentas de teste e validação de sistemas  estudo de caso projeto",
	"ch": "60",
	"periodo": "0",
	"pre": ["if977"],
	"co": [],
	"creditos": "4",
	"site": "",
	"class": "si",
	"id": "if1009",
	"box": "13"
}]